" Отключить номера строк, иногда нужно чтобы скопировать
set nu!
" Чтобы открыть любой документ в горизонтальном сплите снизу
sp имя_файла.txt

" При нажатии появится окно комнадной строки, где можно изменить ошибку и
" выполнить сразу команду
q

" Показывает историю команд, можно указать сразу фильтр 
history
" or
hi

" Можно повторно вызывать команду по номеру строки из истории
@498

" Чтобы получить содержимое из stdout от команды ls (Или любой другой) надо
" вызвать 
r !ls 

" Если мы хотим создать документ, который будет содержать вывод команды, то надо
" сделать следующим образом
$ echo "Test" | vim -

" Посмотреть как vim определил тип файла
set filetype?

" Посмотреть разные текущие настройки 
" Размер таба в пробелах
set tabstop?
set ts?
" Поменять этот параметр
set ts=2
" Размер отступа при использовании команд <> а также при автотсупах
set shiftwidth?
" Заменяются ли tab на пробелы
set expandtab?
set et?
" Поменять этот параметр
set expandtab
set et
" Или
set noexpandtab
set noet

" Поиск с игнором регистра
set ignorecase
" Или 
set ic
" Для отключения
set noic
" Если в моменте, тогда надо поставить \c
/word_search\c
